/*Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

14212 -> нет

12821 -> да

23432 -> да*/

Console.Clear();
Console.WriteLine("Введите пятизначное число: ");
int number = int.Parse(Console.ReadLine());
if (number > 9999 || number < 10000)
if
int result
Console.WriteLine ("Число является палиндромом");
else 
Console.WriteLine ("Это число не палиндром");
